Repository: CherokeeLanguage/Action-Imitation-and-Fun-Series
Catalog: 06-Red-Riding-Hood/CAT/red-riding-hood-seven-kids/tm/corpus-nt-bbe.en.utf8.tmx
Source language: en
Languages: chr

source: Preaching the kingdom of God and teaching about the Lord Jesus Christ without fear, and no orders were given that he was not to do so.
chr: ᎠᎵᏥᏙᎲᏍᎬᎩ ᎧᏃᎮᏍᎬᎩ ᎤᏁᎳᏅᎯ ᎤᎬᏫᏳᎯ ᎨᏒᎢ, ᎠᎴ ᏓᏕᏲᎲᏍᎬᎩ ᎧᏃᎮᏍᎬᎩ ᎤᎬᏫᏳᎯ ᏥᏌ ᎦᎶᏁᏛ, ᎤᏍᏗᎤᏅ ᎾᏍᎦᎢᎲᎾ, ᎠᎴ ᎩᎶ ᏄᏅᏍᏓᏕᎲᎾ.

source: Epistle to the Romans
chr: ᏉᎳ ᎶᎻ ᎠᏁᎯ ᏧᏬᏪᎳᏁᎸᎯ

source: Paul, a servant of Jesus Christ, an Apostle by the selection of God, given authority as a preacher of the good news,
chr: ᏉᎳ, ᏥᏌ ᎦᎶᏁᏛ ᎠᎩᏅᏏᏓᏍᏗ, ᎥᎩᏅᏏᏛ ᎢᏴᏋᏁᎸᎯ, ᎥᏆᏓᏓᎴᏔᏅᎯ ᎣᏍᏛ ᎧᏃᎮᏛ ᎤᏁᎳᏅᎯ ᎤᏤᎵ ᎠᏆᎵᏥᏙᏗᏱ,

source: Of which God had given word before by his prophets in the holy Writings,
chr: ᎾᏍᎩ ᎤᏚᎢᏍᏔᏅᎯ ᏥᏂᎨᏎ ᎠᎾᏙᎴᎰᏍᎩ ᏕᎬᏗᏍᎬ ᎾᎿ ᎦᎸᏉᏗᏳ ᎪᏪᎵᎯ,

source: About his Son who, in the flesh, came from the family of David,
chr: ᎾᏍᎩ ᎤᏪᏥ ᎤᎬᏩᎵ, ᎾᏍᎩ ᏕᏫ ᎤᏁᏢᏔᏅᏛ ᎨᏒ ᏧᏕᏁᎢ ᎾᏍᎩ ᎤᏇᏓᎵ ᎨᏒᎢ;

source: But was marked out as Son of God in power by the Holy Spirit through the coming to life again of the dead; Jesus Christ our Lord,
chr: ᎦᎸᏉᏗᏳᏍᎩᏂ ᎤᏓᏅᏙ ᎨᏒ ᎤᏣᏘ ᎤᎵᏂᎩᏛ ᎬᏂᎨᏒ ᏥᎾᎬᏁᎴ ᎤᏁᎳᏅᎯ ᎤᏪᏥ ᎨᏒᎢ, ᎾᏍᎩ ᎾᎿ ᎤᏲᎱᏒ ᏚᎴᎯᏌᏅᎢ; ᎾᏍᎩ ᏥᏌ ᎦᎶᏁᏛ ᎤᎬᏫᏳᎯ ᎢᎦᏤᎵᎦ,

source: Through whom grace has been given to us, sending us out to make disciples to the faith among all nations, for his name:
chr: ᎾᏍᎩ ᎣᎩᏁᎸᎯ ᏥᎩ ᎬᏩᎦᏘᏯ ᎤᏓᏙᎵᏍᏗ ᎨᏒ ᎠᎴ ᎣᎩᏅᏏᏛ ᎨᏒᎢ, ᎾᏍᎩ ᏧᎾᏓᏂᎸᎢᏍᏗᏱ ᎪᎯᏳᏗ ᎨᏒ ᎾᏂᎥ ᏧᎾᏓᎴᏅᏛ ᏴᏫ, ᎾᏍᎩ ᏚᏙᎥ ᏅᏗᎦᎵᏍᏙᏗᏍᎬᎢ;

source: Among whom you in the same way have been marked out to be disciples of Jesus Christ:
chr: ᎾᎿ ᎾᏍᏉ ᎢᏣᏓᏑᏯ ᏂᎯ, ᏥᏌ ᎦᎶᏁᏛ ᎢᏥᏯᏅᏛ ᏥᎩ;

source: To all those who are in Rome, loved by God, marked out as saints: Grace to you and peace from God our Father and the Lord Jesus Christ.
chr: ᏂᏥᎥ ᎶᎻ, ᎤᏁᎳᏅᎯ ᎢᏥᎨᏳᎯ, ᎡᏥᏯᏅᏛ ᎢᏣᏓᏅᏘ; ᎬᏩᎦᏘᏯ ᎤᏓᏙᎵᏍᏗ ᎨᏒ ᎠᎴ ᏅᏩᏙᎯᏯᏛ ᎨᏤᎳᏗᏙᎮᏍᏗ, ᏅᏓᏳᎾᎵᏍᎪᎸᏔᏅᎯ ᎤᏁᎳᏅᎯ ᎢᎩᏙᏓ, ᎠᎴ ᎤᎬᏫᏳᎯ ᏥᏌ ᎦᎶᏁᏛ.

source: First of all, I give praise to my God through Jesus Christ for you all, because news of your faith has gone into all the world.
chr: ᎢᎬᏱᏱ ᎨᏒᎢ, ᏥᏯᎵᎡᎵᏤᎭ ᎠᏆᏁᎳᏅᎯ ᎬᏗᎭ ᏚᏙᎥ ᏥᏌ ᎦᎶᏁᏛ, ᏂᏥᎥ ᏂᎯ ᎨᏒ ᎢᏳᏍᏗ, ᏅᏗᎦᎵᏍᏙᏗᎭ ᎢᏦᎯᏳᏒ ᏂᎬᎾᏛ ᎡᎶᎯ ᎠᏂᏃᎮᏍᎬᎢ.

source: For God is my witness, whose servant I am in spirit in the good news of his Son, that you are at all times in my memory and in my prayers,
chr: ᎤᏁᎳᏅᎯᏰᏃ ᎠᏉᎯᏳᏓᏁᎯ, ᎾᏍᎩ ᎪᎱᏍᏗ ᏥᏥᏯᏛᏁᎭ ᎠᏆᏓᏅᏙ ᏥᎬᏗᎭ ᎾᏍᎩ ᎣᏍᏛ ᎧᏃᎮᏛ ᎤᏪᏥ ᎤᏤᎵᎦ ᎬᏂᎨᏒ ᏂᎬᏁᎲᎢ, ᎾᏍᎩ ᏂᏥᏲᎯᏍᏗᏍᎬᎾ ᎢᏨᏁᎢᏍᏗᏍᎬᎢ, ᏂᎪᎯᎸ ᎦᏓᏙᎵᏍᏗᏍᎬ.

source: And that I am ever making prayers that God will give me a good journey to you.
chr: ᏥᏔᏲᎯᎲᎢ, ᎾᏍᎩ ᎢᏳᏃ ᏰᎵ ᏱᎩ ᎪᎯ ᎿᏉ ᎣᏍᏛ ᎢᏯᏆᎵᏍᏓᏁᎸᏍᏗᏱ ᎦᎢᏒ ᏫᏨᎷᏤᏗᏱ, ᎤᏁᎳᏅᎯ ᎣᏏᏳ ᎠᏰᎸᏍᎬ ᏅᏓᏳᎵᏍᏙᏗᏱ.

source: For I have a strong desire to see you, and to give you some grace of the spirit, so that you may be made strong;
chr: ᎤᏣᏘᏰᏃ ᎠᏆᏚᎵ ᎢᏨᎪᏩᏛᏗᏱ, ᎾᏍᎩ ᏗᏨᏲᎯᏎᏗᏱ ᎪᎱᏍᏗ ᎤᏍᏗ ᎠᏓᏅᏙ ᎤᎵᏍᏕᎸᏙᏗ ᎨᏒᎢ, ᎾᏍᎩ ᏗᏣᎵᏂᎪᎯᏍᏗᏱ ᏭᎵᏱᎶᎯᏍᏗᏱ;

source: That is to say, that all of us may be comforted together by the faith which is in you and in me.
chr: ᎾᏍᎩ ᎯᎠ ᏄᏍᏗ, ᎾᏍᎩ ᎠᏴ ᎢᏧᎳᎭ ᎢᎩᎧᎵᏍᏙᎯᏍᏗᏱ ᎬᏔᏅᎯ ᎠᏴ ᏂᎯᏃ ᎤᏠᏱ ᎢᎪᎯᏳᏒᎢ.

source: You may be certain, my brothers, that it has frequently been in my mind to come to you (but till now I was kept from it), so that I might have some fruit from you in the same way as I have had it from the other nations.
chr: ᎾᏍᎩᏃ ᎢᏓᎵᏅᏟ ᎥᏝ ᎾᏂᎦᏔᎲᎾᏉ ᎨᏎᏍᏗ ᏱᏨᏰᎵᏎᎭ, ᎾᏍᎩ ᎤᏣᏘ ᎢᏳᏩᎫᏗ ᏓᏇᎪᏔᏅ ᏫᏨᎷᏤᏗᏱ, ᎾᏍᎩ ᎪᎱᏍᏗ ᎤᎦᏔᏔᏅᎯ ᏂᎯ ᎾᏍᏉ ᎢᏤᎲ ᎠᎩᎪᏩᏛᏗᏱ ᎠᎩᏰᎸᏒᎩ, ᎾᏍᎩᏯ ᏄᏍᏛ ᎠᏂᏐᎢ ᏧᎾᏓᎴᏅᏛ ᏴᏫ ᏓᏁᏩᏗᏒᎢ; ᎠᏎᏃ ᎪᎯ ᎢᏯᏍᏗ ᎠᏆᏓᏄᎴᎭ.

source: I have a debt to Greeks and to the nations outside; to the wise and to those who have no learning.
chr: ᎬᎩᏚᎦ ᎢᏧᎳ ᎠᏂᎪᎢ ᎠᎴ ᏅᏩᎾᏓᎴ ᏴᏫ, ᎠᏂᎦᏔᎾᎢ ᎠᎴ ᎠᏂᎦᏔᎾᎢ ᏂᎨᏒᎾ.

source: For which reason I have the desire, as far as I am able, to give the knowledge of the good news to you who are in Rome.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎢᎬᏆᏛᏁᏗ ᎨᏒ ᎢᎦᎢ, ᎠᏆᏛᏅᎢᏍᏗᏉ ᎣᏍᏛ ᎧᏃᎮᏛ ᎢᏨᏯᎵᏥᏙᏁᏗᏱ ᎶᎻ ᎾᏍᏉ ᎢᏤᎯ ᏂᎯ.

source: For I have no feeling of shame about the good news, because it is the power of God giving salvation to everyone who has faith, to the Jew first, and then to the Greek.
chr: ᎥᏝᏰᏃ ᏱᎦᏕᎣᏍᎦ ᎣᏍᏛ ᎧᏃᎮᏛ ᎦᎶᏁᏛ ᎤᏤᎵᎦ; ᎾᏍᎩᏰᏃ ᎤᏁᎳᏅᎯ ᎤᎵᏂᎩᏗᏳ ᎨᏒ ᎬᏂᎨᏒ ᎢᎬᏁᎯ, ᎾᏍᎩ ᎾᎿ ᎠᎾᎵᏍᏕᎸᏙᏗᏍᎬ ᎾᏂᎥ ᎠᏃᎯᏳᎲᏍᎩ; ᎠᏂᏧᏏ ᎢᎬᏱ, ᎠᎴ ᎾᏍᏉ ᎠᏂᎪᎢ.

source: For in it there is the revelation of the righteousness of God from faith to faith: as it is said in the holy Writings, The man who does righteousness will be living by his faith.
chr: ᎾᎿᏰᏃ ᎬᏂᎨᏒ ᎢᎬᏁᎸᎯ ᏄᏍᏛ ᎤᏓᏚᏓᎴᏍᏙᏗ ᎨᏒ ᎤᏁᎳᏅᎯ, ᎪᎯᏳᏗ ᎨᏒ ᏅᏛᏓᎴᎲᏍᎩ, ᎠᎴ ᎪᎯᏳᏗ ᎨᏒ ᏩᏍᏆᏗᏍᏗᏍᎩ; ᎾᏍᎩᏯ ᏂᎬᏅᎪᏪᎸᎢ, ᏚᏳᎪᏛᏍᎩᏂ ᎢᏯᏛᏁᎯ ᎪᎯᏳᏗ ᎨᏒ ᎤᏛᏂᏗᏍᏕᏍᏗ.

source: For there is a revelation of the wrath of God from heaven against all the wrongdoing and evil thoughts of men who keep down what is true by wrongdoing;
chr: ᎤᎾᎳᏅᎯᏰᏃ ᎤᏔᎳᏬᎯᏍᏗ ᎨᏒ ᎬᏂᎨᏒ ᎢᎬᏁᎸᎯ ᎦᎸᎶᎢ ᏨᏗᏓᎴᎲᏍᎦ ᏥᏓᎦᏘᎴᎦ ᏄᏓᎴᏒ ᎤᏁᎳᏅᎯ ᏄᏂᎸᏉᏛᎾ ᎨᏒ, ᎠᎴ ᏂᏚᏳᎪᏛᎾ ᎢᏳᎾᏛᏁᏗ ᎨᏒ ᏴᏫ, ᎾᏍᎩ ᏚᏳᎪᏛ ᏣᏂᎾᎯᏍᏗᎭ ᎤᏲ ᏚᏂᎸᏫᏍᏓᏁᎲᎢ;

source: Because the knowledge of God may be seen in them, God having made it clear to them.
chr: ᏅᏗᎦᎵᏍᏙᏗᎭ ᎾᏍᎩ Ꮎ ᎤᏁᎳᏅᎯ ᏰᎵ ᎬᎦᏙᎥᎯᏍᏙᏗ ᎨᏒ ᎬᏂᎨᏒ ᎢᎬᏁᎸᎯ ᎠᏁᎲᎢ; ᎤᏁᎳᏅᎯᏰᏃ ᏚᎾᏄᎪᏫᏎᎸ.

source: For from the first making of the world, those things of God which the eye is unable to see, that is, his eternal power and existence, are fully made clear, he having given the knowledge of them through the things which he has made, so that men have no reason for wrongdoing:
chr: ᎾᏍᎩᏰᏃ ᏗᎬᎪᏩᏛᏗ ᏂᎨᏒᎾ ᎨᏒ ᏧᏤᎵᎦ ᎬᏂᎨᏒᎢᏳ ᏗᎬᎪᏩᏛᏗ ᎢᎩ ᎡᎶᎯ ᏧᏙᏢᏅ ᏅᏓᎬᏩᏓᎴᏅᏛ, ᏗᎦᎪᎵᏍᏙᏗ ᎢᎩ ᏧᏓᎴᏅᏛ ᏗᎪᏢᏅᎯ ᎨᏒᎢ, ᎾᏍᎩ ᏅᏧᏓᎴᏅᎲᎾ ᎤᎵᏂᎩᏗᏳ ᎨᏒᎢ, ᎠᎴ ᎤᏁᎳᏅᎯ ᎨᏒᎢ; ᎾᏍᎩ ᎢᏳᏍᏗ ᎥᏝ ᏳᏂᎭ ᏧᎾᏢᏫᏍᏙᏗ;

source: Because, having the knowledge of God, they did not give glory to God as God, and did not give praise, but their minds were full of foolish things, and their hearts, being without sense, were made dark.
chr: ᎤᏂᎦᏙᎥᏒᏰᏃ ᎤᏁᎳᏅᎯ, ᎥᏝ ᎤᏁᎳᏅᎯ ᎦᎸᏉᏙᏗ ᎨᏒ ᏳᏂᎸᏉᏙᏔᏁᎢ, ᎥᏝ ᎠᎴ ᏯᎾᎵᎮᎵᎨᎢ, ᎠᎾᏓᏅᏖᏍᎬᏍᎩᏂ ᎠᏎᏉᏉ ᏄᎵᏍᏔᏁᎢ, ᎠᎴ ᏧᏁᎫ ᏧᏂᎾᏫ ᏚᎵᏏᎲᏎᎢ;

source: Seeming to be wise, they were in fact foolish,
chr: ᎠᏂᎦᏔᎾᎢ ᎠᎾᏤᎸᏍᎬᎢ, ᎤᏂᏁᎫ ᏄᎾᎵᏍᏔᏁᎢ;

source: And by them the glory of the eternal God was changed and made into the image of man who is not eternal, and of birds and beasts and things which go on the earth.
chr: ᎠᎴ ᎤᏂᏁᏟᏴᏎ ᎦᎸᏉᏗᏳ ᎨᏒ ᎤᏁᎳᏅᎯ ᎠᏲᎱᏍᎩ ᏂᎨᏒᎾ ᎤᏤᎵᎦ, ᎠᏲᎱᏍᎩ ᏴᏫ ᏗᏟᎶᏍᏔᏅᎯ ᎾᏍᎩᏯ ᏄᏅᏁᎴᎢ, ᎠᎴ ᏥᏍᏆ, ᎠᎴ ᏅᎩ ᏗᏂᏅᏌᏗ, ᎠᎴ ᎠᎾᏓᎾᏏᏂᏙᎯ.

source: For this reason God gave them up to the evil desires of their hearts, working shame in their bodies with one another:
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎤᏁᎳᏅᎯ ᎾᏍᏉ ᏕᎤᏲᏎ ᎦᏓᎭ ᏧᏂᎸᏫᏍᏓᏁᏗᏱ ᎤᏅᏙᏗᏱ ᎤᏅᏒ ᏧᏂᎾᏫᏱ ᎤᎾᏑᎸᏅᏗ ᎨᏒᎢ, ᏧᏂᏐᏢᎢᏍᏙᏗᏱ ᏗᏂᏰᎸ ᎤᏅᏒᏉ ᏂᏓᎾᏓᏛᏁᎲᎢ;

source: Because by them the true word of God was changed into that which is false, and they gave worship and honour to the thing which is made, and not to him who made it, to whom be blessing for ever. So be it.
chr: ᎾᏍᎩ ᎤᏙᎯᏳᏒ ᎤᏁᎳᏅᎯ ᎤᏃᎮᏍᎩ ᎤᏂᏁᏟᏴᏍᏔᏁ ᎦᏰᎪᎩ ᎨᏒᎢ, ᎠᎴ ᎤᏟ ᎢᎦᎢ ᎤᎾᏓᏙᎵᏍᏓᏁᎴ ᎠᎴ ᎪᎱᏍᏗ ᎤᎾᏛᏁᎴ ᎠᎪᏢᏅᎯᏉ ᎨᏒ ᎡᏍᎦᏉ ᎢᎦᎢ ᎤᏬᏢᏅᎯ, ᎾᏍᎩ ᎦᎸᏉᏙᏗ ᏥᎩ ᏂᎪᎯᎸᎢ. ᎡᎺᏅ.

source: For this reason God gave them up to evil passions, and their women were changing the natural use into one which is unnatural:
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎤᏁᎳᏅᎯ ᏕᎤᏲᏒᎩ ᎤᏕᎰᎯᏍᏗ ᎤᎾᏚᎸᏅᏗᏱ; ᎾᏍᏉᏰᏃ ᎠᏂᎨᏴ ᏧᎾᏤᎵᎦ ᎾᏍᎩ ᎠᎲ ᎢᏳᎾᏛᏁᏗ ᎨᏒ ᎤᏂᏁᏟᏴᏍᏔᏁ ᎾᏍᎩ ᎠᎲ ᎢᏳᎾᏛᏁᏗ ᏂᎨᏒᎾ ᎨᏒᎢ.

source: And in the same way the men gave up the natural use of the woman and were burning in their desire for one another, men doing shame with men, and getting in their bodies the right reward of their evil-doing.
chr: ᎠᎴ ᎾᏍᏉ ᎠᏂᏍᎦᏯ ᏚᏂᏲᏍᎨ ᎢᏳᎾᏛᏁᏗ ᎨᏒ ᎾᏍᎩ ᎠᏂᎨᏴ ᎨᎦᏁᎳᏅᎯ ᎤᎬᏩᎵ ᎨᏒᎢ, ᎤᏣᏘ ᏓᎾᏓᏕᎳᏲᏍᎨ ᎤᏅᏒᏉ ᎨᏒᎢ; ᎠᏂᏍᎦᏯ ᎠᏂᏍᎦᏯᏉ ᎪᎱᏍᏗ ᏓᎾᏓᏛᏗᏍᎨ ᏚᏂᎸᏫᏍᏓᏁᎮ ᎾᏍᎩ ᎤᏕᎰᎯᏍᏗ ᎨᏒᎢ, ᎠᎴ ᎤᏅᏒ ᎨᏒ ᎤᎾᎵᏩᏛᎡᎮ ᏚᏳᎪᏛ ᎨᎦᎫᏴᎡᏗ ᎨᏒ ᎾᏍᎩ ᎤᏂᎵᏓᏍᏗᏍᎬᎢ.

source: And because they had not the mind to keep God in their knowledge, God gave them up to an evil mind, to do those things which are not right;
chr: ᎠᎴ ᎾᏍᎩ ᎣᏏ ᏄᏂᏰᎸᏒᎾ ᏥᎨᏎ ᏄᏍᏛ ᎤᏁᎳᏅᎯ ᎤᏂᎦᏙᎥᏒ ᎤᏂᏍᏆᏂᎪᏙᏗᏱ, ᎤᏁᎳᏅᎯ ᏕᎤᏲᏎ ᎨᏥᏐᏅᎢᏍᏔᏅᎯ ᎢᏳᎾᎵᏍᏙᏗᏱ ᏚᎾᏓᏅᏛᎢ, ᎾᏍᎩ ᎢᎬᏛᏁᏗ ᏂᎨᏒᎾ ᎨᏒ ᎢᏳᎾᏛᏁᏗᏱ;

source: Being full of all wrongdoing, evil, desire for the goods of others, hate, envy, putting to death, fighting, deceit, cruel ways, evil talk, and false statements about others;
chr: ᎤᏂᎧᎵᏨᎯ ᎨᏒ ᏄᏓᎴᏒ ᏂᏚᏳᎪᏛᎾ ᎨᏒᎢ, ᎤᏕᎵᏛ ᏗᏂᏏᏗ ᎨᏒᎢ, ᎤᏲ ᎢᏯᏓᏛᏁᏗ ᎨᏒᎢ, ᏧᎬᏩᎶᏗ ᎠᎬᎥᎯᏍᏗ ᎨᏒᎢ, ᎤᏂᏲ ᎨᏒᎢ; ᎤᏂᎧᎵᏨᎯ ᎠᏛᏳᎨᏗ ᎨᏒᎢ, ᏗᏓᎯᏍᏗ ᎨᏒᎢ, ᏗᏘᏲᏍᏗ ᎨᏒᎢ, ᎠᏠᏄᎮᏛ, ᎤᏲ ᏗᎦᎸᏫᏍᏓᏁᏗ ᎨᏒᎢ; ᎠᎾᏙᏅᎢᎯ,

source: Hated by God, full of pride, without respect, full of loud talk, given to evil inventions, not honouring father or mother,
chr: ᎤᏲ ᏗᎾᏓᏃᎮᎵᏙᎯ, ᎤᏁᎳᏅᎯ ᎠᏂᏂᏆᏘᎯ, ᎬᏩᎾᏓᏐᏢᏗ; ᎤᎾᏢᏉᏗ, ᎤᎾᏢᏆᏌᏗ, ᎠᏃᎷᏩᏘᏍᎩ ᏧᏓᎴᏅᏛ ᎤᏲᎢ, ᏂᏚᏃᎯᏳᏒᎾ ᏧᏂᎦᏴᎵᎨᎢ,

source: Without knowledge, not true to their undertakings, unkind, having no mercy:
chr: ᏄᏃᎵᏣᏛᎾ, ᎧᏃᎮᏛ ᏚᎾᏠᎯᏍᏛ ᎠᏂᏲᏍᏗᏍᎩ, ᎪᎱᏍᏗ ᏧᏅᎾ ᏂᏚᏂᎨᏳᏒᎾ, ᎬᏩᏃᎯᏍᏗ ᏂᎨᏒᎾ, ᏄᎾᏓᏙᎵᏣᏛᎾ;

source: Who, though they have knowledge of the law of God, that the fate of those who do these things is death, not only go on doing these things themselves, but give approval to those who do them.
chr: ᎾᏍᎩ ᏣᏂᎦᏔᎭ ᏄᏍᏛ ᏕᎫᎪᏗᏍᎬ ᎤᏁᎳᏅᎯ, ᎾᏍᎩ ᎩᎶ ᎾᏍᎩ ᎢᏳᏍᏗ ᏧᎸᏫᏍᏓᏁᎯ ᏰᎵᏉ ᏗᎬᏩᏂᏲᎱᎯᏍᏗ ᎨᏒᎢ, ᎥᏝ ᎾᏍᎩᏉ ᎾᎾᏛᏁᎲ ᎤᏩᏒ ᏱᎩ, ᎣᏏᏳᏍᎩᏂ ᏚᏂᏰᎸᎭ ᎾᏍᎩ ᎢᏯᎾᏛᏁᎯ.

source: So you have no reason, whoever you are, for judging: for in judging another you are judging yourself, for you do the same things.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎥᏝ ᏗᏣᏢᏫᏍᏙᏗ ᏱᏣᎭ, ᏂᎯ ᏴᏫ ᏂᏥᎥᏉ ᏗᏧᎪᏗᏍᎩ; ᎾᎿᏰᏃ ᏅᏩᏓᎴ ᏕᎯᏳᎪᏓᏁᎲ ᏨᏒ ᏕᎭᏓᏚᎪᏓᏁᎭ; ᏂᎯᏰᏃ ᏚᎪᏗᏍᎩ ᎾᏍᎩᏯ ᏂᎭᏛᏁᎭ.

source: And we are conscious that God is a true judge against those who do such things.
chr: ᎠᏎᏃ ᎢᏗᎦᏔᎭ ᎾᏍᎩ ᎤᏁᎳᏅᎯ ᏕᎫᎪᏗᏍᎬ ᏚᏳᎪᏛ ᎨᏒᎢ, ᎾᏍᎩ ᏕᎫᎪᏓᏁᎲ ᎾᏍᎩ ᎢᏯᎾᏛᏁᎯ.

source: But you who are judging another for doing what you do yourself, are you hoping that God's decision will not take effect against you?
chr: ᏥᎪᏃ ᎭᏓᏅᏖᏍᎬ ᏂᎯ ᏴᏫ, ᎾᏍᎩ ᏚᎪᏓᏁᎯ ᏥᎩ ᎾᏍᎩ ᎢᏯᎾᏛᏁᎯ, ᎠᎴ ᎾᏍᎩᏯ ᎢᎭᏛᏁᎯ ᏥᎩ, ᏔᏚᏓᎳᎡᎵ ᎤᏁᎳᏅᎯ ᏧᏭᎪᏙᏗ ᎨᏒᎢ?

source: Or is it nothing to you that God had pity on you, waiting and putting up with you for so long, not seeing that in his pity God's desire is to give you a change of heart?
chr: ᏥᎪᎨ ᏅᎵᏌᎵᏉ ᎯᏰᎸᏍᎦ ᏄᏧᏈᏍᏛ ᎤᏓᏅᏘᏳ ᎨᏒ ᎠᎴ ᎬᏂᏗᏳ ᎨᏒᎢ, ᎠᎴ ᎪᎯᏗᏳ ᎤᏁᎳᎩ ᏒᎵᏍᎬᎢ, ᏂᎦᏔᎲᎾᏉ ᎨᏒ ᎾᏍᎩ ᎤᏁᎳᏅᎯ ᎤᏓᏅᏘᏳ ᎨᏒ ᏣᏘᏁᎬ ᏣᏁᏟᏴᏍᏗ ᎨᏒ ᏣᏓᏅᏛᎢ?

source: But by your hard and unchanged heart you are storing up wrath for yourself in the day of the revelation of God's judging in righteousness;
chr: ᎾᏍᎩᏯᏍᎩᏂ ᎯᏍᏓᏱᏳ ᎨᏒ ᎠᎴ ᏣᏁᏟᏴᏛ ᏂᎨᏒᎾ ᏣᎾᏫ ᎯᏟᏏᎭ ᎤᏔᎳᏬᎯᏍᏗ ᎨᏒ ᏣᏤᎵ ᎢᏳᎵᏍᏙᏗ ᎾᎯᏳ ᎢᎦ ᎠᎵᏱᎶᎸᎭ ᎤᏓᎳᏬᎯᏍᏗ ᎨᏒ ᎠᎴ ᎤᏁᎳᏅᎯ ᏚᏳᎪᏛ ᏧᏭᎪᏙᏗ ᎨᏒ ᎦᎾᏄᎪᏫᏒᎭ;

source: Who will give to every man his right reward:
chr: ᎾᏍᎩ ᎾᏂᎥ ᏧᎫᏴᎡᏗ ᏥᎩ ᎾᏍᎩᏯ ᏄᏍᏛ ᏚᏂᎸᏫᏍᏓᏁᎸᎢ;

source: To those who go on with good works in the hope of glory and honour and salvation from death, he will give eternal life:
chr: ᎾᏍᎩ ᎣᏍᏛ ᏚᏂᎸᏫᏍᏓᏁᎲ ᏗᏅᏂᏗᏳ ᎬᎾᎢᏒ ᏧᏂᏯᏍᏗᎭ ᏗᎬᏩᎸᏌᏛ ᎠᎴ ᎦᎸᏉᏗᏳ ᎨᏒ ᎠᎴ ᎠᏲᎱᎯᏍᏗ ᏂᎨᏒᎾ ᎨᏒᎢ, ᎠᎵᏍᏆᏗᏍᎩ ᏂᎨᏒᎾ ᎬᏂᏛ ᏧᎫᏴᏓᏁᏗ ᏥᎩ;

source: But to those who, from a love of competition, are not guided by what is true, will come the heat of his wrath,
chr: Ꮎ-ᏍᎩᏂ [ᎤᏁᎳᏅᎯ] ᏗᏂᎦᏘᎴᎩ ᏥᎩ, ᎠᎴ ᎾᏃᎯᏳᎲᏍᎬᎾ ᏥᎩ ᏚᏳᎪᏛ ᎨᏒᎢ, ᏂᏚᏳᎪᏛᎾᏍᎩᏂ ᎨᏒ ᎠᏃᎯᏳᎲᏍᎩ ᏥᎩ; ᎤᏔᎳᏬᎯᏍᏗ ᎠᎴ ᎤᎿᎸᎯ ᎨᏒ ᎤᏂᎷᏤᏗ ᎨᏎᏍᏗ.

source: Trouble and sorrow on all whose works are evil, to the Jew first and then to the Greek;
chr: ᎤᏕᏯᏙᏗ ᎨᏒ ᎠᎴ ᎤᏪᎵᎯᏍᏗ ᎨᏒ ᎤᏂᎷᏤᏗ ᎨᏎᏍᏗ ᎾᏂᎥ ᎠᏂᏏᏴᏫᎭ ᎨᏒᎢ, ᎾᏍᎩ ᎤᏲ ᎢᏯᎾᏛᏁᎯ, ᎠᏂᏧᏏ ᎢᎬᏱ, ᎠᎴ ᎾᏍᏉ ᎠᏂᎪᎢ;

source: But glory and honour and peace to all whose works are good, to the Jew first and then to the Greek:
chr: ᏗᎬᏩᎸᏌᏛᏍᎩᏂ ᎠᎴ ᎦᎸᏉᏗᏳ ᎨᏒ, ᎠᎴ ᏅᏩᏙᎯᏯᏛ ᎤᏂᎷᏤᏗ ᎨᏎᏍᏗ ᎾᏂᎥ ᎠᏂᏏᏴᏫᎭ ᎨᏒ ᎣᏍᏛ ᎢᏯᎾᏛᏁᎯ, ᎠᏂᏧᏏ ᎢᎬᏱ, ᎠᎴ ᎾᏍᏉ ᎠᏂᎪᎢ;

source: For one man is not different from another before God.
chr: ᎤᏁᎳᏅᎯᏰᏃ ᎥᏝ ᎩᎶ ᏗᎦᎸᏉᏗᏍᎩ ᏱᎩ.

source: All those who have done wrong without the law will get destruction without the law: and those who have done wrong under the law will have their punishment by the law;
chr: ᎾᏂᎥᏰᏃ ᎩᎶ ᎤᏂᏍᎦᏅᏨᎯ ᏗᎧᎿᏩᏛᏍᏗ ᏄᏂᎲᎾ ᎾᏍᏉ ᏗᎧᎿᏩᏛᏍᏗ ᏂᎬᏔᏅᎾ ᎤᏂᎩᎵᏲᎢᏍᏗ; ᎠᎴ ᎾᏂᎥ ᎩᎶ ᎤᏂᏍᎦᏅᏨᎯ ᏗᎧᎿᏩᏛᏍᏗ ᎤᏂᎯ, ᎾᏍᎩ ᏗᎧᎿᏩᏛᏍᏗ ᎨᎬᏓᏁᏗ ᏗᎨᎫᎪᏓᏁᏗ ᎨᏎᏍᏗ,

source: For it is not the hearers of the law who will be judged as having righteousness before God, but only the doers:
chr: ᎥᏝᏰᏃ ᏗᎧᎿᏩᏛᏍᏗ ᎠᎾᏛᎩᏍᎩ ᎾᏂᏍᎦᏅᎾ ᏱᎩ ᎤᏁᎳᏅᎯ ᏓᎧᏅᎢ, ᏗᎧᎿᏩᏛᏍᏗᏍᎩᏂ ᏂᎦᏪᏍᎬ ᎢᏯᎾᏛᏁᎯ ᎾᏍᎩ ᎤᎾᏚᏓᎴᏍᏗ ᎨᏎᏍᏗ.

source: For when the Gentiles without the law have a natural desire to do the things in the law, they are a law to themselves;
chr: ᏧᎾᏓᎴᏅᏛᏰᏃ ᏴᏫ ᏗᎧᎿᏩᏛᏍᏗ ᏄᏂᎲᎾ ᏥᎩ, ᎤᏅᏒ ᎤᎾᏓᏅᏖᏛ ᏗᎧᎿᏩᏛᏍᏗ ᏂᎦᏪᏍᎬ ᏱᎾᎾᏛᏁᎭ, ᎾᏍᎩ ᎯᎠ, ᏗᎧᎿᏩᏛᏍᏗ ᏄᏂᎲᎾ ᏥᎩ, ᎤᏅᏒᏉ ᎨᏒ ᏗᎧᎿᏩᏛᏍᏗ ᎾᎾᎵᏍᏗᎭ;

source: Because the work of the law is seen in their hearts, their sense of right and wrong giving witness to it, while their minds are at one time judging them and at another giving them approval;
chr: ᎾᏍᎩ ᎬᏂᎨᏒ ᎾᏅᏁᎭ ᏗᎧᎿᏩᏛᏍᏗ ᏂᎦᏪᏍᎬ ᎢᏯᏛᏁᏗ ᎨᏒ ᏧᏂᎾᏫᏱ ᎪᏪᎸᎢ, ᏚᎾᏓᏅᏛ ᎾᏍᏉ ᎪᎯᏳᏙᏗᏍᎬᎢ, ᎠᎴ ᎠᎾᏓᏅᏖᏍᎬ ᏓᎾᏓᏚᎯᏍᏗᏍᎬ, ᎠᎴ ᏓᎾᏓᏚᏓᎴᏍᎬᎢ.

source: In the day when God will be a judge of the secrets of men, as it says in the good news of which I am a preacher, through Jesus Christ.
chr: ᎾᎯᏳ ᎢᎦ ᎤᏁᎳᏅᎯ ᎤᏕᎵᏛ ᎨᏒ ᏴᏫ ᎤᎾᏤᎵᎦ ᏕᎫᎪᏓᏁᎸᎭ, ᏥᏌ ᎦᎶᏁᏛ ᎠᎬᏗᏍᎬᎢ, ᎾᏍᎩᏯ ᏂᎦᏪᏍᎬ ᎠᏆᏤᎵ ᎣᏍᏛ ᎧᏃᎮᏛ.

source: But as for you who have the name of Jew, and are resting on the law, and take pride in God,
chr: ᎬᏂᏳᏉ, ᎠᏧᏏ ᏕᏣᏙᎥ, ᎠᎴ ᏗᎧᎿᏩᏛᏍᏗ ᏣᎵᏍᎦᏍᏙᏗ, ᎠᎴ ᎯᏯᏢᏆᏍᏙᏗ ᎤᏁᎳᏅᎯ,

source: And have knowledge of his desires, and are a judge of the things which are different, having the learning of the law,
chr: ᎠᎴ ᎯᎦᏔᎭ ᏄᏍᏛ ᎣᏏᏳ ᎤᏰᎸᏗ ᎨᏒᎢ, ᎠᎴ ᎯᎪᏩᏘᎭ ᏧᏓᎴᏅᏛ ᏧᏓᎴᎿᎢ ᎨᏒᎢ, ᎡᏤᏲᏅᎯ ᏗᎧᎿᏩᏛᏍᏗᏱ;

source: In the belief that you are a guide to the blind, a light to those in the dark,
chr: ᎠᎴ ᎥᏝ ᏱᏣᏜᏏᏛᎡᎭ ᏨᏒ ᏔᏘᏂᏙᎯ ᎨᏒ ᏗᏂᎨᏫ, ᎢᎦ ᏔᏘᏍᏓᏁᎯ ᎨᏒ ᎤᎵᏏᎬ ᎠᏂᏂ,

source: A teacher of the foolish, having in the law the form of knowledge and of what is true;
chr: ᏖᏲᎲᏍᎩ ᎨᏒ ᏄᎾᏓᏅᏛᎾ, ᏗᏂᏲᎵ ᏖᏲᎲᏍᎩ, ᎾᏍᎩ ᏣᏍᏆᏂᎪᏗ ᎠᎦᏙᎥᎯᏍᏗ ᎨᏒ ᎠᎴ ᏚᏳᎪᏛ ᎨᏒ ᏗᏟᎶᏍᏔᏅᎯ ᏗᎧᎿᏩᏛᏍᏗᏱ ᎪᏪᎸᎢ.

source: You who give teaching to others, do you give it to yourself? you who say that a man may not take what is not his, do you take what is not yours?
chr: ᎾᏍᎩᏃ ᏂᎯ ᏅᏩᏓᎴ ᎯᏰᏲᎲᏍᎩ ᏥᎩ, ᏝᏍᎪ ᏨᏒ ᏯᏓᏕᏲᎲᏍᎦ? ᏂᎯ ᎭᎵᏥᏙᎲᏍᎬ ᏞᏍᏗ ᏣᏃᏍᎩᏒᎩ ᏣᏗᎭ, ᏥᎪ ᎢᎯᏃᏍᎩᎭ?

source: You who say that a man may not be untrue to his wife, are you true to yours? you who are a hater of images, do you do wrong to the house of God?
chr: ᏂᎯ, ᏞᏍᏗ ᏣᏓᏲᏁᎸᎩ ᏣᏗᎭ, ᏥᎪ ᎢᎭᏓᏲᏁᎭ? ᏂᎯ, ᎤᏁᎴᏅᎯ ᏗᏰᎸᎯ ᏥᏕᎯᏂᏆᏘᎭ, ᏥᎪ ᏂᎯ ᎪᎱᏍᏗ ᎦᎸᏉᏗ ᎯᏐᏢᏗᎭ?

source: You who take pride in the law, are you doing wrong to the honour of God by behaviour which is against the law?
chr: ᏂᎯ ᏗᎧᎿᏩᏛᏍᏗ ᏣᏢᏆᏙᏗᎭ, ᎯᏲᏍᏗᏍᎬᏍᎪ ᏗᎧᎿᏩᏛᏍᏗ ᎠᏐᏢᎯ ᏂᏴᏁ ᎤᏁᎳᏅᎯ?

source: For the name of God is shamed among the Gentiles because of you, as it is said in the holy Writings.
chr: ᎤᏁᎳᏅᎯᏰᏃ ᏚᏙᎥ ᎬᏩᏂᏐᏢᏗ ᏧᎾᏓᎴᏅᏛ ᏴᏫ ᎠᏁᎲᎢ ᏂᎯ ᎢᏨᏂᏌᏛ, ᎾᏍᎩᏯ ᏂᎬᏅ ᎪᏪᎸᎢ.

source: It is true that circumcision is of use if you keep the law, but if you go against the law it is as if you had it not.
chr: ᎠᎱᏍᏕᏍᏗᏰᏃ ᎨᏒ ᎤᏙᎯᏳᎯ ᏣᏍᏕᎵᎭ ᎢᏳᏃ ᏗᎧᎿᏩᏛᏍᏗ ᏂᎦᏪᏍᎬ ᏱᎿᏛᏁᎭ; ᎢᏳᏍᎩᏂ ᎯᏲᏍᏗᏍᎩ ᏱᎩ ᏗᎧᎿᏩᏛᏍᏗ, ᎡᏣᎱᏍᏕᏎᎸᎯ ᎨᏒ ᎡᏣᎱᏍᏕᏎᎸᎯᏉ ᏂᎨᏒᎾ ᏂᎦᎵᏍᏗᎭ.

source: If those who have not circumcision keep the rules of the law, will it not be credited to them as circumcision?
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎢᏳᏃ ᎠᏥᎤᏍᏕᏎᎸᎯ ᏂᎨᏒᎾ ᏯᏍᏆᏂᎪᏗᎭ ᏗᎧᎿᏩᏛᏍᏗ ᎾᏍᎩᏯ ᏂᎬᏅᎢ, ᏝᏍᎪ ᎾᏥᎤᏍᏕᏎᎸᎾ ᎨᏒ ᎠᏥᎤᏍᏕᏎᎸᎯ ᎨᏒ ᎠᏥᏰᎸᎾᏁᏗ ᏱᎦᎩ?

source: And they, by their keeping of the law without circumcision, will be judges of you, by whom the law is broken though you have the letter of the law and circumcision.
chr: ᎠᎴ ᏝᏍᎪ ᎠᏥᎤᏍᏕᏎᎸᎯ ᏂᎨᏒᎾ, ᎾᏍᎩ ᎤᏕᏅᏉ ᏄᏍᏛ ᏗᎧᎿᏩᏛᏍᏗ ᎠᏍᏆᏂᎪᏗᏍᎩ ᏱᏙᎨᏧᎪᏓᏏ ᏂᎯ, ᎪᏪᎵ ᎠᎴ ᎠᎱᏍᏕᏍᏗ ᎨᏒ ᏗᎬᏗ ᏗᎧᎿᏩᏛᏍᏗ ᎯᏲᏍᏗᏍᎩ?

source: The true Jew is not one who is only so publicly, and circumcision is not that which may be seen in the flesh:
chr: ᎥᏝᏰᏃ ᎾᏍᎩ Ꮎ ᎠᏧᏏ ᏱᎩ, ᎦᏚᏉ ᎢᏗᏢ ᎠᏧᏏ ᏱᎩ; ᎥᏝ ᎠᎴ ᎾᏍᎩ Ꮎ ᎠᎱᏍᏕᏍᏗ ᎨᏒ ᏱᎩ, ᎦᏚᏉ ᎢᏗᏢ ᎤᏇᏓᎸᏉ ᏱᎩ;

source: But he is a Jew who is a secret one, whose circumcision is of the heart, in the spirit and not in the letter; whose praise is not from men, but from God.
chr: ᎾᏍᎩᏍᎩᏂ Ꮎ ᎠᏧᏏ, ᎾᏍᎩ ᎭᏫᏂᏗᏢ ᎠᏧᏏ ᏥᎩ, ᎠᎴ ᎾᏍᎩ Ꮎ ᎠᎱᏍᏕᏍᏗ ᎨᏒ ᎤᎾᏫᏱ ᎡᎯ ᏥᎩ, ᎤᏓᏅᏙᎩᎯ ᎡᎯ, ᎥᏝᏃ ᎪᏪᎵᏉ ᏂᎦᏪᏍᎬ ᏗᎧᎿᏩᏕᎩ; ᎾᏍᎩ ᎥᏝ ᏴᏫᏉ ᎬᏩᎸᏉᏙᏗ ᏱᎩ, ᎤᏁᎳᏅᎯᏍᎩᏂ.

source: How then is the Jew better off? or what profit is there in circumcision?
chr: ᎦᏙᎨᏃ ᎤᏍᏛ ᎤᏟ ᏄᏛᏅ ᎠᏧᏏ? ᎠᎴ ᎦᏙ ᎤᏍᏛ ᎬᏩᏓᏍᏕᎸᏗ ᎠᎱᏍᏕᏍᏗ ᎨᏒᎢ?

source: Much in every way: first of all because the words of God were given to them.
chr: ᎤᏣᏘ ᏂᎦᎥ ᏄᏓᎴᏒᎢ; ᏄᎬᏫᏳᏒ ᎠᏗᎾ ᏅᏗᎦᎵᏍᏙᏗ ᎾᏍᎩ ᎨᎦᎨᏅᏴ ᎤᏁᎳᏅᎯ ᎤᏁᏨᎢ.

source: And if some have no faith, will that make the faith of God without effect?
chr: ᎦᏙᏃ ᎢᏳ ᎢᎦᏛ ᏄᏃᎯᏳᏅᎾ ᏱᎩ? ᏥᎪ ᏄᏃᎯᏳᏅᎾ ᎨᏒ ᎠᏎᏉᏉ ᏱᏂᎬᎦ ᎤᏁᎳᏅᎯ ᎦᎪᎯᏳᏗ ᎨᏒᎢ?

source: In no way: but let God be true, though every man is seen to be untrue; as it is said in the Writings, That your words may be seen to be true, and you may be seen to be right when you are judged.
chr: ᎬᏩᏟᏍᏗ; ᎥᎥ, ᎤᏁᎳᏅᎯ ᏚᏳᎪᏛ ᎧᏁᎩ ᎨᏎᏍᏗ, ᎾᏂᎥᏃ ᏴᏫ ᎠᏂᏰᎪᎩ ᎨᏎᏍᏗ; ᎾᏍᎩᏯ ᎯᎠ ᏂᎬᏅ ᎪᏪᎸᎢ, ᎾᏍᎩ ᏂᏍᎦᏅᎾ ᎢᏳᎵᏍᏙᏗᏱ ᎯᏁᎬᎢ, ᎠᎴ ᏣᏓᏎᎪᎩᏍᏗᏱ ᎿᏉ ᏕᎱᎪᏔᏅᎭ.

source: But if the righteousness of God is supported by our wrongdoing what is to be said? is it wrong for God to be angry (as men may say)?
chr: ᎠᏎᏃ ᎢᏳᏃ ᏂᏚᏳᎪᏛᎾ ᏃᎦᏛᏁᎸ ᎬᏂᎨᏒ ᏱᏂᎬᏁᎭ ᏚᏳᎪᏛ ᎢᏯᏛᏁᎯ ᎨᏒ ᎤᏁᎳᏅᎯ, ᎦᏙ ᏓᏓᏛᏂ? ᎠᏍᎦᏅᎦᏍᎪ ᎤᏁᎳᏅᎯ ᎾᏍᎩ ᏥᏓᏍᏛᏗᏍᏙᏗᎭ? (ᏴᏫᏉ ᎢᏳᏪᏍᏗ ᏂᏥᏪᎭ).

source: In no way: because if it is so, how is God able to be the judge of all the world?
chr: ᎬᏩᏟᏍᏗ; ᎢᏳᏰᏃ ᎾᏍᎩ ᏱᏄᏍᏗ ᎦᏙ ᏱᎦᎵᏍᏙᏓ ᎤᏁᎳᏅᎯ ᎡᎶᎯ ᏱᏕᎫᎪᏓᏏ?

source: But if, because I am untrue, God being seen to be true gets more glory, why am I to be judged as a sinner?
chr: ᎢᏳᏰᏃ ᏚᏳᎪᏛ ᎧᏁᎩ ᎨᏒ ᎤᏁᎳᏅᎯ ᎤᏟ ᎢᎦᎢ ᎤᏁᏉᏨᎯ ᏱᎩ ᎾᏍᎩ ᎦᎸᏉᏗᏳ ᏄᏩᏁᎲᎢ ᎠᏴ ᎦᏥᎪᎲᏍᎬ ᏱᏅᏗᎦᎵᏍᏙᏗᎭ, ᎦᏙᏃ ᎠᏴ ᎾᏍᏉ ᎠᏏᏉ ᏛᏊᎪᏓᏁᎭ ᏥᏍᎦᎾ ᎾᏍᎩᏯᎢ?

source: Let us not do evil so that good may come (a statement which we are falsely said by some to have made), because such behaviour will have its right punishment.
chr: ᎠᎴᏍᎪ ᎥᏝ ᎾᏍᎩ ᎯᎠ ᏳᎬᏫᏳᎭ, (ᎾᏍᎩ ᎦᏲᎩᏐᏢᏛ ᏥᎪᎩᏃᎮᎭ, ᎠᎴ ᎩᎶ ᎾᏍᎩ ᎾᏂᏪ ᏥᎪᎪᏎᎭ,) ᎤᏲ ᏕᎩᎸᏫᏍᏓᏁᎮᏍᏗ ᎾᏍᎩ ᎣᏍᏛ ᎨᏒ ᎤᎵᏰᎢᎸᏍᏗᏱ? ᎾᏍᎩ ᎤᏂᏍᎦᏅᏨ ᏧᎾᏚᎪᏓᏁᏗᏱ ᏚᏳᎪᏗ.

source: What then? are we worse off than they? In no way: because we have before made it clear that Jews as well as Greeks are all under the power of sin;
chr: ᎦᏙᎨ ᎤᎬᏫᏳᎭ? ᎤᏟᏍᎪ ᏂᏙᎯ? ᎥᏝ ᎤᏍᏗᎩᏛ ᎤᏅ; ᎦᏳᎳᏰᏃ ᏕᎫᎪᏔᏅ ᎾᏍᎩ ᎢᏧᎳ ᎠᏂᏧᏏ ᎠᎴ ᏧᎾᏓᎴᏅᏛ ᏴᏫ, ᏂᎦᏗᏳ ᎠᏍᎦᏅᎢᏍᏗ ᎨᏒ ᎤᎾᏓᏄᏴᏛᎢ.

source: As it is said in the holy Writings, There is not one who does righteousness;
chr: ᎾᏍᎩᏯ ᎯᎠ ᏥᏂᎬᏅ ᏥᎪᏪᎳ, ᎥᏝ ᎩᎶ ᎣᏏᏳ ᎢᏯᏛᏁᎯ ᏱᎩ, ᎥᏝ, ᏌᏉ ᎤᏅ.

source: Not one who has the knowledge of what is right, not one who is a searcher after God;
chr: ᎥᏝ ᎩᎶ ᎪᎵᎩ ᏱᎩ; ᎥᏝ ᎩᎶ ᎤᏁᎳᏅᎯ ᎤᏲᎯ ᏱᎩ.

source: They have all gone out of the way, there is no profit in any of them; there is not one who does good, not so much as one:
chr: ᎾᏂᎥᏉ ᎤᎾᏞᏒ ᎦᏅᏅᎢ, ᎢᏳᎾᏍᏗᎭᏉ ᎪᎱᏍᏗ ᏗᎬᏙᏗ ᏂᎨᏒᎾ ᏄᎾᎵᏍᏔᏅ; ᎥᏝ ᎩᎶ ᎣᏏᏳ ᎢᏯᏛᏁᎯ ᏱᎩ, ᎥᏝ ᏌᏉ ᎤᏅ.

source: Their throat is like an open place of death; with their tongues they have said what is not true: the poison of snakes is under their lips:
chr: ᎤᏂᎩᏍᏗᏱ ᏗᏓᏂᏐᏗᏱ ᎤᎵᏍᏚᎢᏛ ᏥᎨᏐ ᎾᏍᎩᏯᎢ; ᏗᏂᏃᎪᎢ ᎠᎾᏓᎶᏄᎮᏗᏍᎪᎢ, ᎢᎾᏛ ᏚᏂᏁᎲ ᎠᏓᎯᎯ ᏚᏂᎭᏁᎦᎸ ᎭᏫᏂᏗᏢ ᏚᏂᏁᎭ.

source: Whose mouth is full of curses and bitter words:
chr: ᎾᏍᎩ ᏗᏂᎰᎵ ᏗᎧᎵᏬᎯ ᎠᏓᏍᎩᏅᏗᏍᏗ ᎨᏒ ᎠᎴ ᎤᏴᏍᏗ ᎨᏒᎢ.

source: Their feet are quick in running after blood;
chr: ᏧᎾᎳᏏᏕᏂ ᏗᏯᏄᎵᏳ ᎩᎬ ᎤᎾᏓᏤᏪᏗᏱ.

source: Destruction and trouble are in their ways;
chr: ᎠᏛᏗᏍᎩ ᎨᏒ ᎠᎴ ᎤᏲ ᎠᏓᏅᏓᏗᏍᏗ ᎨᏒ ᏔᎵ ᎤᏛᏗᏕᎪ ᎠᏁᏙᎲᎢ.

source: And of the way of peace they have no knowledge:
chr: ᏅᏩᏙᎯᏯᏛᏃ ᎦᏅᏅ ᎥᏝ ᎤᏂᎦᏙᎥᏒᎯ ᏱᎩ.

source: There is no fear of God before their eyes.
chr: ᎤᏁᎳᏅᎯ ᎦᎾᏰᎯᏍᏗ ᎨᏒ ᎥᏝ ᎢᎬᏱᏗᏢ ᏱᏄᏍᏗ ᏗᏂᎧᏅᎢ.

source: Now, we have knowledge that what the law says is for those who are under the law, so that every mouth may be stopped, and all men may be judged by God:
chr: ᎠᎴ ᎢᏗᎦᏔᎭ ᎾᏍᎩ ᏂᎦᎥ ᏂᎦᏪᏍᎬ ᏗᎧᎿᏩᏛᏍᏗ ᎤᏂᏁᏤᎭ ᎾᏍᎩ ᏗᎧᎿᏩᏛᏍᏗ ᎨᏥᏁᏄᎯ; ᎾᏍᎩ ᎾᏂᎥ ᏗᏂᎰᎵ ᏗᎨᏥᏍᏚᏁᏗᏱ, ᎠᎴ ᎡᎳᏂᎬ ᎠᏁᎯ ᎤᏂᏍᎦᏅᏨᎯ ᏧᏚᎪᏔᏅᎯ ᎢᏳᎵᏍᏙᏗᏱ ᎤᏁᎳᏅᎯ ᎠᎦᏔᎲᎢ.

source: Because by the works of the law no man is able to have righteousness in his eyes, for through the law comes the knowledge of sin.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᏗᎧᎿᏩᏛᏍᏗ ᏂᎦᏪᏍᎬ ᏄᏛᏁᎲ ᎥᏝ ᎩᎶ ᎤᏇᏓᎵ ᏴᎬᏚᏓᎴᏍᏓ ᎾᏍᎩ ᎠᎦᏔᎲᎢ; ᏗᎧᎿᏩᏛᏍᏗᏰᏃ ᎠᏍᎦᏅᎢᏍᏗ ᎨᏒ ᎠᎦᏙᎥᎯᏍᏙᏗ.

source: But now without the law there is a revelation of the righteousness of God, to which witness is given by the law and the prophets;
chr: ᎤᏁᎳᏅᎯᏍᎩᏂ ᎤᏓᏚᏓᎴᏍᏙᏗ ᎨᏒ, ᏗᎧᎿᏩᏛᏍᏗ ᎬᏙᏗ ᏂᎨᏒᎾ, ᎬᏂᎨᏒ ᎢᎬᏁᎸᎯ, ᎪᎯᏳᏙᏔᏅᎯ ᏗᎧᎿᏩᏛᏍᏗ ᎠᎴ ᎠᎾᏙᎴᎰᏍᎬ ᏚᏃᏪᎸᎢ;

source: That is, the righteousness of God through faith in Jesus Christ, to all those who have faith; and one man is not different from another,
chr: ᎾᏍᎩ ᎤᏁᎳᏅᎯ ᎤᏓᎦᏓᎴᏍᏗ ᎨᏒᎢ, ᎾᏍᎩ ᏥᏌ ᎦᎶᏁᏛ ᎪᎯᏳᏗ ᏨᏗᏓᎴᎲᏍᎦ, ᎠᎴ ᎾᏍᎩ ᎾᏂᎥ ᎠᏃᎯᏳᎲᏍᎩ ᎤᏂᎷᏤᏗ ᎠᎴ ᎾᏍᎩ ᎾᏂᎥ ᎤᎾᏤᎵ ᎢᏳᎵᏍᏙᏗ ᏥᎩ; ᎥᏝᏰᏃ ᏧᎾᏓᎴᎿᎢ ᏱᎩ;

source: For all have done wrong and are far from the glory of God;
chr: ᏂᎦᏗᏳᏰᏃ ᎤᏂᏍᎦᏅᏨᎯ, ᎠᎴ ᎡᏍᎦ ᎤᏃᎭᏒ ᎤᏁᎳᏅᎯ ᎤᏓᎸᏉᏙᏗ ᎨᏒᎢ;

source: And they may have righteousness put to their credit, freely, by his grace, through the salvation which is in Christ Jesus:
chr: ᎨᎫᏓᎴᏛ ᏂᏗᎨᏥᎬᏩᎶᏓᏁᎸᎾ ᎬᏔᏅᎯ ᎬᏩᎦᏘᏯ ᎤᏓᏙᎵᏍᏗ ᎨᏒ ᏅᏓᏳᏓᎴᏅᎯ ᎠᎫᏴᏙᎢ ᎨᏒ ᎦᎶᏁᏛ ᏥᏌ ᎤᏪᎲᎢ;

source: Whom God has put forward as the sign of his mercy, through faith, by his blood, to make clear his righteousness when, in his pity, God let the sins of earlier times go without punishment;
chr: ᎾᏍᎩ [ᏥᏌ ᎦᎶᏁᏛ] ᎤᏁᎳᏅᎯ ᎬᏂᎨᏒ ᏥᏄᏩᏁᎸ ᎠᎵᏍᎪᎸᏔᏅᎯ ᎪᎯᏍᏙᏗ ᎨᏒᎢ, ᎾᏍᎩ ᎪᎯᏳᏗᏱ ᎤᎩᎬ; ᏧᎾᏄᎪᏫᏎᏗᏱ ᎾᏍᎩ ᏚᏳᎪᏛ ᎢᏯᏛᏁᎯ ᎨᏒᎢ, ᎾᏍᎩ ᎦᏳᎳ ᎠᏍᎦᏅᏨᎯ ᎨᏒ ᎦᎬᏩᏓᏁᏗ ᎨᏒᎢ, ᎾᏍᎩ ᎤᏁᎳᏅᎯ ᎬᏂᏗᏳ ᎨᏒ ᎢᏳᏩᏂᏌᏅᎯ;

source: And to make clear his righteousness now, so that he might himself be upright, and give righteousness to him who has faith in Jesus.
chr: ᏧᎾᏄᎪᏫᏎᏗᏱ ᎪᎯ ᎨᏒ ᎾᏍᎩ ᏚᏳᎪᏛ ᎢᏯᏛᏁᎯ ᎨᏒᎢ; ᎾᏍᎩ ᏚᏳᎪᏛ ᎢᏯᏛᏁᎯ ᎢᏳᎵᏍᏙᏗᏱ, ᎠᎴ ᎫᏓᎴᏍᎩ ᎾᏍᎩ Ꮎ ᎪᎯᏳᎲᏍᎩ ᏥᏌ.

source: What reason, then, is there for pride? It is shut out. By what sort of law? of works? No, but by a law of faith.
chr: ᎭᏢᎨᏃ ᎠᏢᏆᏍᏗ ᎨᏒᎢ? ᎢᏴᏛ ᎢᎬᏁᎸᎯ. ᎦᏙ ᎤᏍᏗ ᏗᎧᎿᏩᏛᏍᏗ ᎬᏔᏅᎯ? ᏗᎦᎸᏫᏍᏓᏁᏗᏱᏍᎪ ᎠᏓᏁᏤᎯ? ᎥᏝ; ᏗᎧᎿᏩᏛᏍᏗᏍᎩᏂ ᎬᏔᏅᎯ ᎪᎯᏳᏗ ᎨᏒ ᎠᏓᏁᏤᎯ.

source: For this reason, then, a man may get righteousness by faith without the works of the law.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᏕᏚᎪᏗᎭ ᎾᏍᎩ ᏴᏫ ᎪᎯᏳᏗ ᎨᏒ ᎠᏚᏓᎴᏍᏗᏍᎬ ᏗᎧᎿᏩᏛᏍᏗ ᏂᎬᏅ ᏄᏛᏁᎸᎾ.

source: Or is God the God of Jews only? is he not in the same way the God of Gentiles? Yes, of Gentiles:
chr: ᎤᏁᎳᏅᎯᏍᎪ ᎠᏂᏧᏏᏉ ᎤᏅᏒ ᎤᎾᏤᎵᎦ? ᏝᏍᎪ ᎾᏍᏉ ᏧᎾᏓᎴᏅᏛ ᏴᏫ ᎤᎾᏤᎵᎦ ᏱᎩ? ᎥᎥ, ᏧᎾᏓᎴᏅᏛ ᎾᏍᏉ ᏴᏫ ᎤᎾᏤᎵᎦ.

source: If God is one; and he will give righteousness because of faith to those who have circumcision, and through faith to those who have not circumcision.
chr: ᏌᏉᎯᏳᏰᏃ ᎤᏁᎳᏅᎯ ᎾᏍᎩ ᎪᎯᏳᏗ ᎨᏒ ᏥᏕᎫᏓᎴᏍᏗᎭ ᏗᎨᏥᎤᏍᏕᏎᎸᎯ, ᎠᎴ ᏂᏗᎨᏥᎤᏍᏕᏎᎸᎾ ᎪᎯᏳᏗ ᎨᏒ ᏥᏕᎫᏓᎴᏍᏗᎭ.

source: Do we, then, through faith make the law of no effect? in no way: but we make it clear that the law is important.
chr: ᎾᏍᎩᏍᎪᏃ ᎢᏳᏍᏗ ᎠᏎᏉᏉ ᏂᏛᏁᎭ ᏗᎧᎿᏩᏛᏍᏗ ᎪᎯᏳᏗ ᎨᏒ ᎢᏛᏗᎭ? ᎬᏩᏟᏍᏗ; ᎢᏗᏍᏓᏱᏗᏍᎩᏂ ᏗᎧᎿᏩᏛᏍᏗ.

source: What, then, may we say that Abraham, our father after the flesh, has got?
chr: ᎾᏍᎩᏃ ᏥᏄᏍᏗ ᎦᏙ ᏓᏓᏛᏂ ᎡᏆᎭᎻ ᎢᎩᏙᏓ ᎤᏩᏛᎲ ᎤᏇᏓᎵ ᎨᏒ ᏅᏓᏳᏓᎴᏅᏛ?

source: For if Abraham got righteousness by works, he has reason for pride; but not before God.
chr: ᎢᏳᏰᏃ ᎡᏆᎭᎻ ᏚᎸᏫᏍᏓᏁᎲ ᎤᏚᏓᎴᏍᏔᏅᎯ ᏱᎩ, ᎤᎭ ᎤᏢᏈᏍᏙᏗ; ᎠᏎᏃ ᎥᏝ [ᏳᎭ,] ᎤᏁᎳᏅᎯ ᎠᎦᏔᎲᎢ.

source: But what does it say in the holy Writings? And Abraham had faith in God, and it was put to his account as righteousness.
chr: ᎦᏙᏰᏃ ᎠᏗᎭ ᎦᎸᏉᏗ ᎪᏪᎵ? ᎡᏆᎭᎻ ᎤᏬᎯᏳᏁ ᎤᏁᎳᏅᎯ, ᎾᏍᎩᏃ ᏚᏳᎪᏛ ᎢᏯᏛᏁᏗ ᎨᏒ ᎠᏥᏰᎸᎾᏁᎴᎢ.

source: Now, the reward is credited to him who does works, not as of grace but as a debt.
chr: ᎩᎶᏰᏃ ᏧᎸᏫᏍᏓᏁᎯ ᎠᎦᎫᏴᎡᏗ ᎨᏒ ᎥᏝ ᎬᏩᎦᏘᏯ ᎤᏓᏙᎵᏍᏗ ᎨᏒ ᏱᏅᏗᎦᎵᏍᏙᏗᏍᎪ ᎤᏤᎵ ᏯᏥᏰᎸᎾᏁᎰᎢ, ᎤᏓᏚᎬᏍᎩᏂ ᏅᏗᎦᎵᏍᏙᏗᏍᎪ ᎤᏤᎵ ᎠᏥᏰᎸᎾᏁᎰᎢ.

source: But to him who without working has faith in him who gives righteousness to the evil-doer, his faith is put to his account as righteousness.
chr: Ꮎ-ᏍᎩᏂ ᏂᏚᎸᏫᏍᏓᏁᎲᎾ, ᎪᎯᏳᎲᏍᎩᏉᏍᎩᏂ ᎾᏍᎩ Ꮎ ᎫᏓᎴᏍᎩ ᎠᏍᎦᎾᎢ, ᎾᏍᎩ ᎤᏬᎯᏳᏒ ᏚᏳᎪᏛ ᎢᏯᏛᏁᏗ ᎨᏒ ᎠᏥᏰᎸᎾᏁᎰᎢ.

source: As David says that there is a blessing on the man to whose account God puts righteousness without works, saying,
chr: ᎾᏍᎩᏯ ᎾᏍᏉ ᏕᏫ ᏥᎧᏁᎢᏍᏗᎭ ᎣᏍᏛ ᎢᏳᎵᏍᏓᏁᏗ ᎨᏒ ᏴᏫ, ᎾᏍᎩ Ꮎ ᎤᏁᎳᏅᎯ ᏚᏳᎪᏛ ᎢᏯᏛᏁᏗ ᎨᏒ ᎾᏍᎩᏯ ᎤᏰᎸᎾᏁᎭ ᏂᏚᎸᏫᏍᏓᏁᎸᎾ ᎨᏒᎢ,

source: Happy are those who have forgiveness for their wrongdoing, and whose sins are covered.
chr: [ᎯᎠ ᏥᏂᎦᏪᎭ,] ᎣᏏᏳ ᎢᏳᎾᎵᏍᏓᏁᏗ ᎤᏂᏍᎦᏅᏨ ᎦᎨᏥᏁᎸᎯ, ᎠᎴ ᎤᏲ ᏄᎾᏛᏁᎸ ᎨᎫᏢᎾᏁᎸᎯ;

source: Happy is the man against whom no sin is recorded by the Lord.
chr: ᎣᏏ ᎢᏳᎵᏍᏓᏁᏗ ᏴᏫ ᎾᏍᎩ Ꮎ ᎤᎬᏫᏳᎯ ᎤᏍᎦᏅᏨ ᏄᏭᎪᏍᏗᏍᎬᎾ ᎨᏒᎢ.

source: Is this blessing, then, for the circumcision only, or in the same way for those who have not circumcision? for we say that the faith of Abraham was put to his account as righteousness.
chr: ᎯᎠᏃ ᎾᏍᎩ ᎣᏏᏳ ᎢᏳᏓᎵᏍᏓᏁᏗ ᎨᏒ ᏗᎨᏥᎤᏍᏕᏎᎸᎯᏉᏍᎪ ᎤᏂᎷᏤᎭ, ᏥᎪᎨ ᎾᏍᏉ ᏗᎨᏥᎤᏍᏕᏎᎸᎯ ᏂᎨᏒᎾ? ᎪᎯᏳᏗᏰᏃ ᎨᏒ ᏚᏳᎪᏛ ᎢᏯᏛᏁᏗ ᎨᏒ ᎠᏥᏰᎸᎾᏁᎴ ᎡᏆᎭᎻ ᎢᏓᏗᎭ.

source: How, then, was it judged? when he had circumcision, or when he had it not? Not when he had it, but when he did not have it:
chr: ᎢᎳᎩᏳᏃ ᎾᏍᎩ ᏄᏍᏕ ᎠᏥᏰᎸᎾᏁᎴᎢ? ᏥᎪ ᎠᏥᎤᏍᏕᏎᎸᎯ ᏥᎨᏎᎢ? ᏥᎪᎨ ᎠᏥᎤᏍᏕᏎᎸᎯ ᏂᎨᏒᎾ ᏥᎨᏎᎢ? ᎥᏝ ᎠᏥᎤᏍᏕᏎᎸᎯ ᏥᎨᏎᎢ, ᎠᏥᎤᏍᏕᏎᎸᎯᏍᎩᏂ ᏂᎨᏒᎾ ᏥᎨᏎᎢ.

source: And he was given the sign of circumcision as a witness of the faith which he had before he underwent circumcision: so that he might be the father of all those who have faith, though they have not circumcision, and so that righteousness might be put to their account;
chr: ᎠᎴ ᎠᏥᏁᎴ ᎠᎱᏍᏕᏍᏗ ᎨᏒ ᎤᏰᎸᏛᎢ, ᎠᏍᏓᏱᏗᏍᎩ ᏚᏳᎪᏛ ᎢᏯᏛᏁᏗ ᎨᏒ ᎠᏥᏰᎸᎾᏁᎲᎢ ᏅᏓᏳᏓᎴᏅᎯ ᎤᏬᎯᏳᏒ ᎠᏏ ᎾᏥᎤᏍᏕᏎᎸᎾ ᏥᎨᏎᎢ; ᎾᏍᎩ ᎤᏂᏙᏓ ᎢᏳᎵᏍᏙᏗᏱ ᎾᏂᎥ ᎠᏃᎯᏳᎲᏍᎩ, ᏂᏗᎨᏥᎤᏍᏕᏎᎸᎾ ᎨᏒᎢ; ᎾᏍᎩ ᏚᏳᎪᏛ ᎢᏯᏛᏁᏗ ᎨᏒ ᎾᏍᎩ ᎾᏍᏉ ᎨᏥᏰᎸᎾᏁᏗᏱ;

source: And the father of circumcision to those who not only are of the circumcision, but who keep to the way of that faith which our father Abraham had before he underwent circumcision.
chr: ᎠᎴ ᎾᏍᏉ ᏗᎨᏥᎤᏍᏕᏎᎸᎯ ᎤᏂᏙᏓ ᎢᏳᎵᏍᏙᏗᏱ, ᎾᏍᎩ ᏗᎨᏥᎤᏍᏕᏎᎸᎯ ᎤᏩᏒ ᏂᎨᏒᎾ ᏥᎩ, ᎾᏍᏉᏍᎩᏂ ᎠᏂᏍᏓᏩᏕᎩ ᏥᎩ ᏚᎳᏏᏅᏒ ᎢᎩᏙᏓ ᎡᏆᎭᎻ, ᎾᏍᎩ ᏧᏬᎯᏳᏎ ᎠᏥᎤᏍᏕᏎᎸᎯ ᎠᏏ ᏂᎨᏒᎾ ᏥᎨᏎᎢ.

source: For God's word, that the earth would be his heritage, was given to Abraham, not through the law, but through the righteousness of faith.
chr: ᏣᏥᏚᎢᏍᏓᏁᎴᏰᏃ ᎤᏤᎵ ᎢᏳᎵᏍᏙᏗᏱ ᎡᎶᎯ, ᎥᏝ ᎡᏆᎭᎻ ᎠᎴ ᎾᏍᎩ ᎤᏁᏢᏔᏅᏛ ᎨᏒ ᏗᎧᎿᏩᏛᏍᏗ ᏅᏓᏳᏓᎴᏅᎯ ᏱᎨᏎᎢ, ᎪᎯᏳᏗᏍᎩᏂ ᎠᏚᏓᎴᏍᏙᏗ ᎨᏒ ᏅᏓᏳᏓᎴᏅᎯ ᎨᏎᎢ.
